mcushilei/UCPF/pedestals/mcu/arm/cortex_m4/ambiq/apollo2/common/uart/reg_uart.h
/*******************************************************************************
 *  Copyright(C)2018 by Dreistein<mcu_shilei@hotmail.com>                     *
 *                                                                            *
 *  This program is free software; you can redistribute it and/or modify it   *
 *  under the terms of the GNU Lesser General Public License as published     *
 *  by the Free Software Foundation; either version 3 of the License, or      *
 *  (at your option) any later version.                                       *
 *                                                                            *
 *  This program is distributed in the hope that it will be useful, but       *
 *  WITHOUT ANY WARRANTY; without even the implied warranty of                *
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU          *
 *  General Public License for more details.                                  *
 *                                                                            *
 *  You should have received a copy of the GNU Lesser General Public License  *
 *  along with this program; if not, see http://www.gnu.org/licenses/.        *
*******************************************************************************/


#ifndef __DRIVER_ARM_M4_AMBIQ_APOLLO2_REG_UART_H__
#define __DRIVER_ARM_M4_AMBIQ_APOLLO2_REG_UART_H__

/*============================ INCLUDES ======================================*/
/*============================ MACROS ========================================*/
#define REG_UART0           (*(uart_reg_t *)REG_UART0_BASEADDR)
#define REG_UART1           (*(uart_reg_t *)REG_UART1_BASEADDR)

#define REG_UARTn(n)        (*(uart_reg_t *)(REG_UART0_BASEADDR + 0x00001000 * n))

//*****************************************************************************
//
// UART_DR - UART Data Register
//
//*****************************************************************************
// This is the overrun error indicator.
#define REG_UART_DR_OEDATA_S                      11
#define REG_UART_DR_OEDATA_M                      0x00000800
#define REG_UART_DR_OEDATA(n)                     (((uint32_t)(n) << 11) & 0x00000800)
#define REG_UART_DR_OEDATA_NOERR                  0x00000000
#define REG_UART_DR_OEDATA_ERR                    0x00000800

// This is the break error indicator.
#define REG_UART_DR_BEDATA_S                      10
#define REG_UART_DR_BEDATA_M                      0x00000400
#define REG_UART_DR_BEDATA(n)                     (((uint32_t)(n) << 10) & 0x00000400)
#define REG_UART_DR_BEDATA_NOERR                  0x00000000
#define REG_UART_DR_BEDATA_ERR                    0x00000400

// This is the parity error indicator.
#define REG_UART_DR_PEDATA_S                      9
#define REG_UART_DR_PEDATA_M                      0x00000200
#define REG_UART_DR_PEDATA(n)                     (((uint32_t)(n) << 9) & 0x00000200)
#define REG_UART_DR_PEDATA_NOERR                  0x00000000
#define REG_UART_DR_PEDATA_ERR                    0x00000200

// This is the framing error indicator.
#define REG_UART_DR_FEDATA_S                      8
#define REG_UART_DR_FEDATA_M                      0x00000100
#define REG_UART_DR_FEDATA(n)                     (((uint32_t)(n) << 8) & 0x00000100)
#define REG_UART_DR_FEDATA_NOERR                  0x00000000
#define REG_UART_DR_FEDATA_ERR                    0x00000100

// This is the UART data port.
#define REG_UART_DR_DATA_S                        0
#define REG_UART_DR_DATA_M                        0x000000FF
#define REG_UART_DR_DATA(n)                       (((uint32_t)(n) << 0) & 0x000000FF)

//*****************************************************************************
//
// UART_RSR - UART Status Register
//
//*****************************************************************************
// This is the overrun error indicator.
#define REG_UART_RSR_OESTAT_S                     3
#define REG_UART_RSR_OESTAT_M                     0x00000008
#define REG_UART_RSR_OESTAT(n)                    (((uint32_t)(n) << 3) & 0x00000008)
#define REG_UART_RSR_OESTAT_NOERR                 0x00000000
#define REG_UART_RSR_OESTAT_ERR                   0x00000008

// This is the break error indicator.
#define REG_UART_RSR_BESTAT_S                     2
#define REG_UART_RSR_BESTAT_M                     0x00000004
#define REG_UART_RSR_BESTAT(n)                    (((uint32_t)(n) << 2) & 0x00000004)
#define REG_UART_RSR_BESTAT_NOERR                 0x00000000
#define REG_UART_RSR_BESTAT_ERR                   0x00000004

// This is the parity error indicator.
#define REG_UART_RSR_PESTAT_S                     1
#define REG_UART_RSR_PESTAT_M                     0x00000002
#define REG_UART_RSR_PESTAT(n)                    (((uint32_t)(n) << 1) & 0x00000002)
#define REG_UART_RSR_PESTAT_NOERR                 0x00000000
#define REG_UART_RSR_PESTAT_ERR                   0x00000002

// This is the framing error indicator.
#define REG_UART_RSR_FESTAT_S                     0
#define REG_UART_RSR_FESTAT_M                     0x00000001
#define REG_UART_RSR_FESTAT(n)                    (((uint32_t)(n) << 0) & 0x00000001)
#define REG_UART_RSR_FESTAT_NOERR                 0x00000000
#define REG_UART_RSR_FESTAT_ERR                   0x00000001

//*****************************************************************************
//
// UART_FR - Flag Register
//
//*****************************************************************************
// This bit holds the transmit BUSY indicator.
#define REG_UART_FR_TXBUSY_S                      8
#define REG_UART_FR_TXBUSY_M                      0x00000100
#define REG_UART_FR_TXBUSY(n)                     (((uint32_t)(n) << 8) & 0x00000100)

// This bit holds the transmit FIFO empty indicator.
#define REG_UART_FR_TXFE_S                        7
#define REG_UART_FR_TXFE_M                        0x00000080
#define REG_UART_FR_TXFE(n)                       (((uint32_t)(n) << 7) & 0x00000080)
#define REG_UART_FR_TXFE_XMTFIFO_EMPTY            0x00000080

