mcushilei/UCPF/pedestals/mcu/arm/cortex_m4/ambiq/apollo2/common/uart/reg_uart.h
// This bit holds the receive interrupt clear.
#define REG_UART_IEC_RXIC_S                       4
#define REG_UART_IEC_RXIC_M                       0x00000010
#define REG_UART_IEC_RXIC(n)                      (((uint32_t)(n) << 4) & 0x00000010)

// This bit holds the modem DSR interrupt clear.
#define REG_UART_IEC_DSRMIC_S                     3
#define REG_UART_IEC_DSRMIC_M                     0x00000008
#define REG_UART_IEC_DSRMIC(n)                    (((uint32_t)(n) << 3) & 0x00000008)

// This bit holds the modem DCD interrupt clear.
#define REG_UART_IEC_DCDMIC_S                     2
#define REG_UART_IEC_DCDMIC_M                     0x00000004
#define REG_UART_IEC_DCDMIC(n)                    (((uint32_t)(n) << 2) & 0x00000004)

// This bit holds the modem CTS interrupt clear.
#define REG_UART_IEC_CTSMIC_S                     1
#define REG_UART_IEC_CTSMIC_M                     0x00000002
#define REG_UART_IEC_CTSMIC(n)                    (((uint32_t)(n) << 1) & 0x00000002)

// This bit holds the modem TXCMP interrupt clear.
#define REG_UART_IEC_TXCMPMIC_S                   0
#define REG_UART_IEC_TXCMPMIC_M                   0x00000001
#define REG_UART_IEC_TXCMPMIC(n)                  (((uint32_t)(n) << 0) & 0x00000001)


/*============================ MACROFIED FUNCTIONS ===========================*/
/*============================ TYPES =========================================*/
//! \name uart_reg_t
//! @{
typedef volatile struct {
    reg32_t     DR;
    reg32_t     RSR;
    REG32_RSVD(4)
    reg32_t     FR;
    REG32_RSVD(1)
    reg32_t     ILPR;
    reg32_t     IBRD;
    reg32_t     FBRD;
    reg32_t     LCRH;
    reg32_t     CR;
    reg32_t     IFLS;
    reg32_t     IER;
    reg32_t     IES;
    reg32_t     MIS;
    reg32_t     IEC;
} uart_reg_t;
//! @}


/*============================ GLOBAL VARIABLES ==============================*/
/*============================ PROTOTYPES ====================================*/

#endif 
